Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: The following example creates a topic named `test` with 3 partitions, and a second topic named `messages` with 2 partitions.
zh_cn: 下面的例子创建了一个名为 `test` ，有3个分区的主题，以及另一个名为 `messages` ，有2个分区的主题。

source: The following example customizes the line format used for StatsD:
zh_cn: 下面的例子自定义了用于StatsD的行格式：

source: The following example demonstrates how to receive a payload, store it in the database using Hibernate Reactive with Panache, and send the persisted entity to Kafka:
zh_cn: 下面的例子演示了如何接收一个payload，使用Hibernate Reactive with Panache将其存储在数据库中，并将持久化的实体发送到Kafka：

source: The following example illustrates the use with PostgreSQL, but the approach is applicable to all containers.
zh_cn: 下面的例子展示了在PostgreSQL上的使用，但这个方法也适用于所有的容器。

source: The following example includes a batch of Kafka records inside a transaction.
zh_cn: 以下示例包括在事务中进行 Kafka 记录的批处理。

source: The following examples are for the active record pattern, but the same can be used with repositories.
zh_cn: 下面的例子是针对Active Record模式的，但同样可以应用于Repository模式。

source: The following extensions provide support for Kotlin Coroutines by allowing the use of Kotlin's `suspend` keyword on method signatures.
zh_cn: 以下扩展通过允许在方法签名上使用Kotlin的 `suspend` 关键字，为Kotlin Coroutines提供支持。

source: The following links provide background on the general conventions and Asciidoc syntax.
zh_cn: 以下链接提供了关于一般约定和Asciidoc语法的背景信息。

source: The following semantics are supported:
zh_cn: 支持以下语义：

source: The following snippet provides an example:
zh_cn: 以下代码段提供了一个示例：

source: The following snippets provide examples of YAML configuration:
zh_cn: 以下代码段提供了YAML配置的示例:

source: The following table lists the most used libraries from the Vert.x ecosystem. To access these APIs, add the indicated extension or dependency to your project. Refer to the associated documentation to learn how to use them.
zh_cn: 下表列出了Vert.x生态系统中最常用的库。要访问这些API，请在你的项目中添加指定的扩展或依赖性。请参考相关文档，了解如何使用它们。

source: The following table provides a summary of the options for each authentication mechanism:
zh_cn: 下表提供了每种认证机制的选项摘要：

source: The following variables externalize key information that can change over time, and so references to such information should be done by using the variable inside of {} curly brackets. The complete list of externalized variables for use is given in the following table:
zh_cn: 以下变量外部化了可能随时间而变化的关键信息，因此对这些信息的引用应该通过使用大括号{}中的变量来完成。下表给出了可使用的外部化变量的完整列表。

source: The format for durations uses the standard `java.time.Duration` format. You can learn more about it in the link:https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc].
zh_cn: 持续时间的格式使用标准的 `java.time.Duration` 格式您可以在 https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc] 中了解更多信息。

source: The framework verifies that the producer/consumer chain is complete, meaning that if the application writes messages into an in-memory channel (using a method with only `@Outgoing`, or an `Emitter`), it must also consume the messages from within the application (using a method with only `@Incoming` or using an unmanaged stream).
zh_cn: Quarkus框架会验证生产者/消费者链是否完整，这意味着如果应用程序将消息写入内存channel(仅使用 `@Outgoing` 修饰符方法，或 `Emitter` )，它也必须从应用程序内部消费消息(仅 `@Incoming` 修饰符方法 ，或使用不受管理的流)。

source: The full flavor of GraalVM to use e.g. `19.3.1-java11`. Make sure to use a `java11` version.
zh_cn: 要使用的GraalVM的完整版本，如“19.3.1-java11”。请确保使用 `java11` 版本。

source: The full set of types supported by the serializer/deserializer autodetection is:
zh_cn: 序列化器/反序列化器自动侦测所支持的全部类型有：

source: The function given to the `withTransaction` method receives a `TransactionalEmitter` for producing records, and returns a `Uni` that provides the result of the transaction.
zh_cn: 传入 `withTransaction` 方法的函数参数会使用 `TransactionalEmitter` 来产生记录，并返回 `Uni` 做为事务结果。

source: The generated `pom.xml` contains the following modifications compared to its counterpart when Kotlin is not selected:
zh_cn: 与不选择Kotlin时的对应内容相比，这次生成的 `pom.xml` 包含以下修改：

source: The generated project contains a simple test. Edit the `src/test/java/org/acme/GreetingResourceTest.java` to match the following content:
zh_cn: 生成的项目包含一个简单的测试。编辑 `src/test/java/org/acme/GreetingResourceTest.java` ，以匹配以下内容：

source: The generated project has three lambdas within it. Two that implement the `RequestHandler<?, ?>` interface, and one that implements the `RequestStreamHandler` interface. One that is used and two that are unused. If you open up `src/main/resources/application.properties` you'll see this:
zh_cn: 生成的项目里有三个lambdas。两个实现 `RequestHandler<?, ?>` 接口，一个实现 `RequestStreamHandler` 接口。使用了一个，另两个未使用。如果你打开 `src/main/resources/application.properties` ，你会看到：

source: The generation of the `.debug` file depends on `objcopy`. On common Linux distributions you will need to install the `binutils` package:
zh_cn: `.debug` 文件的生成取决于 `objcopy` 。在常见的Linux发行版上，你将需要安装 `binutils` 包：

source: The handler is called with details of the deserialization, including the action represented as `Uni<T>`. On the deserialization `Uni` failure strategies like retry, providing a fallback value or applying timeout can be implemented.
zh_cn: 这个handler在被调用提供反序列化的细节，包括以 `Uni<T>` 所表示的操作(action)。在 `Uni` 提供的反序列化错误处理策略中，可以实现例如重试，提供回调(fallback)值或超时处理等等方式。

source: The handler is called with details of the serialization, including the action represented as `Uni<byte[]>`. Note that the method must await on the result and return the serialized byte array.
zh_cn: 处理器被调用，并被提供序列化的细节，包括以 `Uni<byte[]>` 表示的操作。注意，该方法必须对在结果处进行等待，并返回序列化后的字节数组。

source: The host provider can be used to configure the redis client like shown below
zh_cn: `RedisHostsProvider` 可用于配置Redis客户端，如下图所示：

source: The http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] defines the supported types.
zh_cn: link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP类型系统] 定义了支持的类型。

source: The https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] allows you to run your lambdas locally on your laptop in a simulated Lambda environment. This requires https://www.docker.com/products/docker-desktop[docker] to be installed. This is an optional approach should you choose to take advantage of it. Otherwise, the Quarkus JUnit integration should be sufficient for most of your needs.
zh_cn: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] 允许你在模拟的Lambda环境中在你的笔记本电脑上本地运行lambdas。这需要安装 link:https://www.docker.com/products/docker-desktop[docker] 。如果你选择使用它，这是一个可选的方法。否则，Quarkus的JUnit集成应该足以满足你的大部分需求。

source: The https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBC instrumentation] will add a span for each JDBC queries done by your application, to enable it, add the following dependency to your build file:
zh_cn: 通过link:https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBC instrumentation] 可以为您的应用程序的每个JDBC查询添加一个span。要启用它，请在您的构建文件中添加以下依赖：

source: The https://tools.ietf.org/html/rfc7519[JWT specification] defines various levels of security of JWTs that one can use. The {mp-jwt} specification requires that JWTs that are signed with the RSA-256 signature algorithm. This in turn requires an RSA public key pair. On the REST endpoint server side, you need to configure the location of the RSA public key to use to verify the JWT sent along with requests. The `mp.jwt.verify.publickey.location=publicKey.pem` setting configured previously expects that the public key is available on the classpath as `publicKey.pem`. To accomplish this, copy the following content to a `security-jwt-quickstart/src/main/resources/publicKey.pem` file.
zh_cn: 这个 link:https://tools.ietf.org/html/rfc7519[JWT规范] 定义了人们可以使用的JWTs的各种安全级别。{mp-jwt}规范要求JWTs用RSA-256签名算法进行签名。这反过来又需要一个RSA公钥对。在REST终端服务器端，你需要配置RSA公钥的位置，用来验证与请求一起发送的JWT。之前配置的 `mp.jwt.verify.publickey.location=publicKey.pem` ，意思是公钥要能在classpath上作为 `publicKey.pem` 文件能找到。为了达到这个目的，请将以下内容复制到 `security-jwt-quickstart/src/main/resources/publicKey.pem` 文件中。

source: The https://vertx.io/docs/vertx-core/java/#event_bus[Vert.x Event Bus] uses codecs to _serialize_ and _deserialize_ objects. Quarkus provides a default codec for local delivery. So you can exchange objects as follows:
zh_cn: link:https://vertx.io/docs/vertx-core/java/#event_bus[Vert.x事件总线] 使用编解码器来 _序列化_ 和 _反序列化_ 对象。Quarkus为本地交付提供了一个默认的编解码器。所以你可以按以下方式交换对象：

source: The implementation is pretty straightforward and you just need to define your endpoints using the JAX-RS annotations and use the `FruitService` to list/add new fruits.
zh_cn: 实现起来非常简单，你只需要使用JAX-RS注解来定义你的端点，并使用 `FruitService` 来list/add新的fruits。

source: The implementation is pretty straightforward and you just need to define your endpoints using the JAX-RS annotations.
zh_cn: 实现起来相当简单，你只需要使用JAX-RS注解来定义你的节点。

source: The implementation of the `project(Class)` method uses the constructor's parameter names to build the select clause of the query, so the compiler must be configured to store parameter names inside the compiled class. This is enabled by default if you are using the Quarkus Maven archetype. If you are not using it, add the property `<maven.compiler.parameters>true</maven.compiler.parameters>` to your `pom.xml`.
zh_cn: 在 `project(Class)` 方法的实现中，使用构造函数的参数名来构建查询的select子句，所以编译器必须配置为在编译的类中保留参数名。如果是使用Quarkus Maven archetype创建的项目，该功能默认是启用的。如果你没有使用，请在你的 `pom.xml` 中添加该属性 `<maven.compiler.parameters>true</maven.compiler.parameters>` 。

source: The implementation of the `project(Class)` method uses the constructor's parameter names to build the select clause of the query, so the compiler must be configured to store parameter names inside the compiled class. This is enabled by default if you are using the Quarkus Maven archetype. If you are not using it, add the property `<maven.compiler.parameters>true</maven.compiler.parameters>` to your pom.xml.
zh_cn: 在 `project(Class)` 方法的实现中，使用构造函数的参数名来构建查询的select子句，所以编译器必须配置为在编译的类中保留参数名。如果是使用Quarkus Maven archetype创建的项目，该功能默认是启用的。如果你没有使用，请在你的 `pom.xml` 中添加该属性 `<maven.compiler.parameters>true</maven.compiler.parameters>` 。

source: The important thing to note is the use of the https://kotlinlang.org/docs/reference/compiler-plugins.html#all-open-compiler-plugin[all-open] Kotlin compiler plugin. In order to understand why this plugin is needed, first we need to note that by default all the classes generated from the Kotlin compiler are marked as `final`.
zh_cn: 需要注意的是，这里使用了 link:https://kotlinlang.org/docs/reference/compiler-plugins.html#all-open-compiler-plugin[all-open] 的Kotlin编译器插件。为了理解为什么需要这个插件，首先我们需要注意：在默认情况下，所有从Kotlin编译器生成的类都被标记为 `final` 。

source: The incoming messages are acknowledged only once the processing completes successfully. So, it commits the offset after the successful processing. If the processing still fails, even after all retries, the message is _nacked_ and the failure strategy is applied.
zh_cn: 传入的消息只有在处理成功完成后才会被确认。所以，它在处理成功后会提交偏移量。如果在所有的重试后处理仍然失败， 消息就会被标记为 _未确认(nacked)_ ，然后触发失败策略。

source: The incoming method can also receive `Message<List<Payload>>`, `KafkaRecordBatch<Key, Payload>` `ConsumerRecords<Key, Payload>` types. They give access to record details such as offset or timestamp:
zh_cn: 接收方法也可以接收 `Message<List<Payload>>` , `KafkaRecordBatch<Key, Payload>` `ConsumerRecords<Key, Payload>` 等类型。这些类型可以访问记录的细节，如偏移量或时间戳：

source: The injected Vert.x instance provides a set of APIs you can use. The one we are going to use in this section is the Vert.x File System. It provides a non-blocking API to access files.
zh_cn: 被注入的Vert.x实例提供了一组你可以使用的API。我们在本节中要使用的是Vert.x文件系统。它提供了一个非阻塞的API来访问文件。

source: The instructions here are exactly as above with one change: you'll need to add `native` as the first parameter to the `manage.sh` script:
zh_cn: 这里的说明与上面的完全一样，但有一个变化：你需要将 `native` 作为第一个参数添加到 `manage.sh` 脚本中：

source: The instrumentation documented in this section has been tested with Quarkus and works in both standard and native mode.
zh_cn: 本节中用到的植入方式已经过Quarkus测试，并且在标准和本地模式下都能工作。

source: The interesting part starts when running the application as a native executable:
zh_cn: 有趣的部分是在将应用程序作为本机可执行文件运行时开始的：

source: The interval in second between two reconnection attempts Type: _int_
zh_cn: 两次尝试重新连接之间的间隔（秒） 类型: _int_

source: The kafka username (the client id from the service account)
zh_cn: Kafka的用户名(来自service account的客户端ID)

source: The key that will be used as the Redis key
zh_cn: 将被用作Redis的Key

source: The lambda can also be invoked locally with the SAM CLI like this:
zh_cn: 这个lambda也可以使用SAM CLI在本地调用，如：

source: The last extension is the reactive database driver for PostgreSQL. Hibernate Reactive uses that driver to interact with the database without blocking the caller thread.
zh_cn: 最后一个扩展是PostgreSQL的响应式数据库驱动程序。Hibernate响应式使用该驱动程序与数据库交互，而不会阻塞调用线程。

source: The last option is to the use the link:https://kotlinlang.org/docs/reference/compiler-plugins.html#no-arg-compiler-plugin[no-arg] compiler plugin. This plugin is configured with a list of annotations, and the end result is the generation of no-args constructor for each class annotated with them.
zh_cn: 最后一个选项是使用 link:https://kotlinlang.org/docs/reference/compiler-plugins.html#no-arg-compiler-plugin[无arg（参数）] 编译器插件。这个插件是用一个注释列表来配置的，最终的结果是为每个有注释的类生成无args（参数）构造函数。

source: The legacy client
zh_cn: 旧客户端

source: The less easy way is to inject a `UserTransaction` and use the various transaction demarcation methods.
zh_cn: 不太容易的方法是注入一个 `UserTransaction` ，并使用各种事务处理方法。

source: The link:http://mongodb.github.io/mongo-java-driver/3.12/bson/pojos[POJO Codec] provides a set of annotations that enable the customization of the way a POJO is mapped to a MongoDB collection and this codec is initialized automatically by Quarkus
zh_cn: link:http://mongodb.github.io/mongo-java-driver/3.12/bson/pojos[POJO编解码器] 提供了一组注解，可以自定义POJO映射到MongoDB集合的方式，该编解码器由Quarkus自动初始化。

source: The listener is invoked every time the consumer topic/partition assignment changes. For example, when the application starts, it invokes the `partitionsAssigned` callback with the initial set of topics/partitions associated with the consumer. If, later, this set changes, it calls the `partitionsRevoked` and `partitionsAssigned` callbacks again, so you can implement custom logic.
zh_cn: 监听器会在消费者的topic/分区分配发生变化时启动。例如，当应用程序启动时，它会调用 `partitionsAssigned` 回调并传入与消费者相关的初始topic/分区集合 。如果后来这个集合发生变化，它会再次调用 `partitionsRevoked` 和 `partitionsAssigned` 回调，所以您可以自行实现对应的逻辑。

source: The location of the getting started page.
zh_cn: 入门页面的位置。

source: The location of the project GitHub organization.
zh_cn: 项目github组织的位置。

source: The location of the project home page.
zh_cn: 项目主页的位置。

source: The main property to configure is the URL to access to MongoDB, almost all configuration can be included in the connection URI so we advise you to do so, you can find more information in the MongoDB documentation: https://docs.mongodb.com/manual/reference/connection-string/
zh_cn: 要配置的主要属性是访问MongoDB的URL，几乎所有的配置都可以包含在连接URI中，所以我们建议你这样做，你可以在MongoDB文档中找到更多信息 https://docs.mongodb.com/manual/reference/connection-string/

source: The max delay (in seconds) between 2 reconnects Type: _int_
zh_cn: 两次重新连接之间的最大延迟（秒） 类型: _int_

source: The max number of seconds to wait to determine if the connection with the broker is still established for the readiness check. After that threshold, the check is considered as failed. Type: _int_
zh_cn: 等待的最大秒数，以确定用于就绪检查的与代理的连接是否仍在建立。在该阈值之后，检查被认为是失败的。 类型: _int_

source: The maximum number of messages to be written to Kafka concurrently. It limits the number of messages waiting to be written and acknowledged by the broker. You can set this attribute to `0` remove the limit Type: _long_
zh_cn: 并发写入Kafka的消息的最大数量。它限制了等待被写入和被broker确认的消息的数量。你设置为： `0` 以解除该限制 类型: _long_

source: The maximum number of reconnection before failing. -1 means infinite retry Type: _int_
zh_cn: 失败前的最大重连次数。-1表示无限重试 类型: _int_

source: The maximum number of seconds that a JWT may be issued for use. Effectively, the difference between the expiration date of the JWT and the issued at date must not exceed this value. Setting this property to a non-positive value relaxes the requirement for the token to have a valid 'iat' (issued at) claim.
zh_cn: JWT可能被发布使用的最大秒数。实际上，JWT的到期日和签发日期之间的差异不得超过这个值。将此属性设置为非正值，可以取消对令牌具有有效的 `iat`（签发日期）声明的要求。

source: The method parameter is the message body. If the method returns _something_, it's the message response.
zh_cn: 方法参数是消息主体。如果该方法返回 _something_ ，那就是消息的响应。

source: The method receives each Fruit. Note that you would need a deserializer to reconstruct the Fruit instances from the Kafka records.
zh_cn: 该方法接收每个Fruit对象。注意，您需要一个反序列化器来从Kafka记录中重建Fruit实例。

source: The method receives the fruit instance to persist. It returns a `CompletionStage` which is used for the transaction demarcation. The transaction is committed when the return `CompletionStage` completes. In our case, it's when the message is written to Kafka.
zh_cn: 该方法接收要持久化的fruit实例。它返回了一个 `CompletionStage` ，用于事务分界。当返回的 `CompletionStage` 完成时，事务即会提交。在我们的例子中，这种情况就是消息被写入Kafka的时候。

source: The micrometer extension will make a best effort at representing URIs containing path parameters in templated form. Using examples from above, a request to `http://localhost:8080/example/prime/7919` should appear as an attribute of `http_server_requests_seconds_*` metrics with a value of `uri=/example/prime/{number}`.
zh_cn: Micrometer扩展将尽最大努力以模板的形式表示包含路径参数的URI。使用上面的例子，一个对 `<a href="http://localhost:8080/example/prime/7919" class="bare">http://localhost:8080/example/prime/7919</a>` 的请求应该作为 `http_server_requests_seconds_*` metrics 的一个属性出现，其值为 `uri=/example/prime/{number}` 。

source: The minimum amount of data the server should return for a fetch request. The default setting of 1 byte means that fetch requests are answered as soon as a single byte of data is available or the fetch request times out waiting for data to arrive. Type: _int_
zh_cn: 针对一个获取请求，服务器所应该返回的最小数据量。默认设置为1个字节，意味着在等待数据到达的同时，一旦有一个字节的数据可用，那么获取请求就会被响应，或者直至获取请求超时。 类型: _int_

source: The mock event server is also started for `@NativeImageTest` and `@QuarkusIntegrationTest` tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
zh_cn: 也会为 `@NativeImageTest` 和 `@QuarkusIntegrationTest` 测试启动模拟事件服务器，因此其也会与本地二进制文件一起工作。所有这些都为SAM CLI本地测试提供了类似的功能，而没有Docker的开销。

source: The most important attributes are listed in the tables below:
zh_cn: 以下表格中列出了最重要的属性：

source: The name of the AMQP Client Option bean used to customize the AMQP client configuration Type: _string_
zh_cn: 用于定制AMQP客户端配置的AMQP客户端选项bean的名称 类型: _string_

source: The name of the link. If not set, the channel name is used. Type: _string_
zh_cn: 链接的名称。如果没有设置，则使用通道名称。 类型: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler`. If set, deserialization failure happening when deserializing keys are delegated to this handler which may retry or provide a fallback value. Type: _string_
zh_cn: 在 `@Identifier` 中设置的实现了 `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler` 的bean的名称。如果被设置，那么在反序列化键时发生的反序列化失败将被委托给这个处理程序，它可以重试或提供一个回退值。 类型: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler`. If set, deserialization failure happening when deserializing values are delegated to this handler which may retry or provide a fallback value. Type: _string_
zh_cn: 在 `@Identifier` 中设置的实现了 `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler` 的bean的名称。如果被设置，那么在反序列化值时发生的反序列化失败将被委托给这个处理程序，它可以重试或提供一个回退值。 类型: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener`. If set, this rebalance listener is applied to the consumer. Type: _string_
zh_cn: 在 `@Identifier` 中设置的实现了 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` 的bean的名称。如果被设置，那么这个再均衡监听器就会应用到消费者上。 类型: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing keys are delegated to this handler which may provide a fallback value. Type: _string_
zh_cn: 在 `@Identifier` 中设置的实现了 `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler` 的bean的名称。如果被设置，那么在序列化键时发生的序列化失败将被委托给这个处理程序，它会重试或提供一个回退值。 类型: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing values are delegated to this handler which may provide a fallback value. Type: _string_
zh_cn: 在 `@Identifier` 中设置的实现了 `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler` 的bean的名称。如果被设置，那么在序列化值时发生的序列化失败将被委托给这个处理程序，它会重试或提供一个回退值。 类型: _string_

source: The native executable for our application will contain the application code, required libraries, Java APIs, and a reduced version of a VM. The smaller VM base improves the startup time of the application and produces a minimal disk footprint.
zh_cn: 我们应用程序的原生可执行文件将包含应用程序代码、所需的库、Java API和一个缩小版的虚拟机。较小的虚拟机基础提高了应用程序的启动时间和最小的磁盘占用。

source: The native executable must be referenced as `runner` if you include a custom `bootstrap` script.
zh_cn: 如果你包含一个自定义的 `bootstrap` 脚本，那么本地可执行文件必须被引用为 `runner` 。

source: The native executable requires some additional steps to enable client SSL that S3 and other AWS libraries need.
zh_cn: 本地可执行文件需要一些额外的步骤来启用S3和其他AWS库需要的客户端SSL。

source: The native image can also be locally tested using the `sam.native.yaml` template:
zh_cn: 本地镜像也可以使用 `sam.native.yaml` 模板进行本地测试：

source: The new `Emitter.send` method returns a `CompletionStage` completed when the produced message is acknowledged.
zh_cn: 新的 `Emitter.send` 方法会返回一个 `CompletionStage` ，并且它会在产生的消息被确认时完成。

source: The node name identifier may be configured via the property `quarkus.transaction-manager.node-name`.
zh_cn: 节点名称标识符可以通过属性 `quarkus.transaction-manager.node-name` 进行配置。

source: The node name identifier needs to be unique per transaction manager deployment. And the node identifier needs to be stable over the transaction manager restarts.
zh_cn: 节点名称标识符需要在每个事务管理器部署中是唯一的。而且节点标识符需要在事务管理器重新启动时保持不变。

source: The node name identifier plays a crucial part in the identification of a transaction. The node name identifier is forged into the transaction id when the transaction is created. Based on the node name identifier, the transaction manager is capable of recognizing the XA transaction counterparts created in database or JMS broker. The identifier makes possible for the transaction manager to roll back the transaction counterparts during recovery.
zh_cn: 节点名称标识符在交易的识别中起着至关重要的作用。当交易被创建时，节点名称标识符被做为成交易ID的一部分。基于节点名称标识符，事务管理器能够识别在数据库或JMS代理中创建的XA事务对应物。该标识符使事务管理器有可能在恢复期间回滚事务对应方。

source: The number of acknowledgments the producer requires the leader to have received before considering a request complete. This controls the durability of records that are sent. Accepted values are: 0, 1, all Type: _string_
zh_cn: 生产者要求领导者认为一个请求完成之前收到的确认的数量。这控制了发送记录的延续性。可接受的值是：0, 1, all 类型: _string_

source: The number of partitions to be consumed concurrently. The connector creates the specified amount of Kafka consumers. It should match the number of partition of the targeted topic Type: _int_
zh_cn: 并发消费的分区的数量。连接器会创建指定数量的Kafka消费者。它应该与目标主题的分区数量相匹配 类型: _int_

source: The number of reconnection attempts Type: _int_
zh_cn: 尝试重新连接的次数 类型: _int_
